function setup() {
  createCanvas(600, 600); // 設定背景大小（600px * 600px)
  background(240); // 設定背景灰階值（白色）
  strokeWeight(3); // 設定線條粗細（3px)
  stroke("black"); // 設定外框顏色（黑色）
  rectMode(CENTER); // 讓矩形以中心點為基準畫
  ellipseMode(CENTER); // 讓橢圓以中心點為基準畫
}

function draw() {

  // 以下統一以 (300,300) 為基準(以畫布中心點為基準)
  translate(300, 300);

  // ============= 黃色填滿圖形 ==============
  // =======================================

  fill("#FFE66F");

  // 身體
  rect(0, 0, 200, 250, 90, 90, 0, 0);

  // 雙腳
  rect(125, 105, 50, 40, 0, 100, 100, 0);
  rect(-125, 105, 50, 40, 100, 0, 0, 100);

  // 雙手
  rect(40, 100, 40, 100, 0, 0, 100, 100);
  rect(-40, 100, 40, 100, 0, 0, 100, 100);
  // =======================================



  // ============= 無色中空圖形 ==============
  // =======================================

  // 只有外框，不填色
  noFill();

  // 圓形嘴巴
  ellipse(0, -20, 90, 50);
  // =======================================



  // ============= 粉色填滿圖形 ==============
  // =======================================

  fill("pink");

  // 蝴蝶結
  triangle(-50, -100, -50, -150, 0, -125);
  triangle(50, -100, 50, -150, 0, -125);
  circle(0, -125, 25);
  // =======================================



  // ============= 黑色填滿圖形 ==============
  // =======================================

  fill("black");

  // 右耳
  push();
  rotate(45);
  ellipse(10, -110, 120, 50);
  pop();

  // 左耳
  push();
  rotate(-45);
  ellipse(-10, -110, 120, 50);
  pop();

  // 鼻子
  push();
  translate(0, -40);
  triangle(-10, 0, 10, 0, 0, 10);
  pop();

  // 左右眼
  circle(-30, -60, 10);
  circle(30, -60, 10);
  // =======================================



}